{
  "name": "Adrián Rueda Fernández",
  "alias": "drilan",
  "tagline": {
    "normal": "Desarrollador multiplataforma creativo",
    "hacked": "ERROR DE SISTEMA: Entidad creativa polimórfica detectada. Capacidad de manifestación en múltiples planos de realidad digital. Nivel de caos: EXPERIMENTAL."
  },
  "summary": {
    "normal": "Buscando nuevos retos y experimentos locos. Especializado en crear experiencias digitales únicas que rompen la norma.",
    "hacked": "ADVERTENCIA: El sujeto busca activamente anomalías y experimentos de alto riesgo. Su arquitectura lógica es impredecible y altamente creativa. Proceder con precaución."
  },
  "location": "Almería, España",
  "availability": "Actualmente empleado en GRS",
  "contact": {
    "email": "drilan@gmail.com",
    "portfolio": "https://placeholder.dev",
    "phone": "691664913",
    "timeZone": "UTC+1 (CET)"
  },
  "social": [
    {
      "label": "LinkedIn",
      "url": "https://www.linkedin.com/in/adrian-rueda/"
    },
    {
      "label": "GitHub",
      "url": "https://github.com/AdrianWheels"
    }
  ],
  "highlights": [
    {
      "title": "Realidad Virtual & Gaming",
      "description": "Desarrollo de experiencias inmersivas con Unity y C# para aplicaciones científicas y artísticas."
    },
    {
      "title": "Neurociencia Aplicada",
      "description": "Creación de pruebas neuropsicológicas digitales y herramientas para investigación cognitiva."
    },
    {
      "title": "Infraestructura Cloud",
      "description": "Administración de sistemas en AWS y gestión de servidores para startups tecnológicas."
    }
  ],
  "hackedHighlights": [
    {
      "title": "Anomalía Dimensional",
      "description": "ADVERTENCIA: Sujeto capaz de analizar tu mente mientras te sumerge en una simulación. Probabilidad de ser un agente de Matrix: 73.2%"
    },
    {
      "title": "Paradoja Temporal",
      "description": "Estudió cómo funciona el cerebro humano solo para después programar mundos que lo confunden. Motivaciones: SOSPECHOSAS."
    },
    {
      "title": "Vector de Contagio Creativo",
      "description": "Ha infectado múltiples departamentos universitarios con su obsesión por la VR. Cuarentena recomendada pero... demasiado tarde."
    }
  ]
}